{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "Conv2D", "config": {"filters": 20, "strides": [1, 1], "use_bias": true, "batch_input_shape": [null, 32, 32, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "kernel_size": [2, 2], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "sigmoid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_5", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 50, "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_6", "kernel_size": [5, 5], "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_6", "padding": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_5", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_6", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "softmax"}}]}, "keras_version": "2.2.4"}