{"keras_version": "2.2.4", "config": {"name": "sequential_12", "layers": [{"config": {"bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv2d_23", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "filters": 20, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_size": [10, 10], "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"name": "activation_45", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_23", "data_format": "channels_first", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_24", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "filters": 50, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "kernel_size": [10, 10]}, "class_name": "Conv2D"}, {"config": {"name": "activation_46", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_24", "data_format": "channels_first", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_12", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "units": 500, "name": "dense_23", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_47", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "units": 100, "name": "dense_24", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_48", "activation": "softmax", "trainable": true}, "class_name": "Activation"}]}, "class_name": "Sequential", "backend": "tensorflow"}