{"keras_version": "2.2.4", "config": {"name": "sequential_3", "layers": [{"config": {"activity_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 32, 32, 3], "name": "conv2d_5", "padding": "same", "filters": 20, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_9", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_5", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_6", "activation": "linear", "filters": 50, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_10", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_6", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_3", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "units": 500, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_5", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_11", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "units": 100, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_6", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_12", "activation": "softmax", "trainable": true}, "class_name": "Activation"}]}, "class_name": "Sequential", "backend": "tensorflow"}