{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"kernel_size": [2, 2], "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 20, "name": "conv2d_1", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "batch_input_shape": [null, 32, 32, 3], "kernel_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [5, 5], "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 50, "name": "conv2d_2", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "use_bias": true, "units": 500, "name": "dense_1", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "use_bias": true, "units": 10, "name": "dense_2", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "softmax"}, "class_name": "Activation"}]}, "backend": "tensorflow", "class_name": "Sequential"}