{"backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "filters": 20, "dtype": "float32", "data_format": "channels_last", "name": "conv2d_23", "activity_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_45", "activation": "tanh"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_23", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "filters": 50, "data_format": "channels_last", "name": "conv2d_24", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_46", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_24", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_12"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_23", "units": 500, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_47", "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_24", "units": 100, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_48", "activation": "softmax"}}], "name": "sequential_12"}, "class_name": "Sequential", "keras_version": "2.2.4"}